Revit 2027 API
WorksetTable.SetActiveWorksetId Method
 Sets the active workset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetActiveWorksetId(
	WorksetId worksetId
)
Public Sub SetActiveWorksetId (
	worksetId As WorksetId
)
public:
void SetActiveWorksetId(
	WorksetId^ worksetId
)
member SetActiveWorksetId :
        worksetId : WorksetId -> unit
Parameters
worksetId WorksetId
 The workset Id.
Exceptions
Exception | Condition
ArgumentException |  There is no workset in the document with this id.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
WorksetTable Class
Autodesk.Revit.DB Namespace